Config.org
* Development

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    ;:custom ((projectile-completion-system 'vertico-mode))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (when (file-directory-p "~/code")
      (setq projectile-project-search-path '("~/code")))
    (setq projectile-switch-project-action #'projectile-dired))

  (use-package magit
    :commands (magit-status magit-get-current-branch)
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

#+end_src
Tab Widths
Default to an indentation size of 2 spaces since it's the norm for pretty much every language I use.

#+begin_src emacs-lisp
  (setq-default tab-width 2)
  (setq-default evil-shift-width tab-width)
#+end_src

Use spaces instead of tabs for indentation

#+begin_src emacs-lisp
  (setq-default indent-tabs-mode nil)
#+end_src

Undo tree
#+begin_src emacs-lisp
  (use-package undo-tree)
  (global-undo-tree-mode)
  (setq undo-tree-history-directory-alist '(("." . "~/.emacs.d/undo")))
#+end_src
** Language Server Support
   #+begin_src emacs-lisp
     (use-package lsp-mode
       :ensure t
       :commands lsp
       :hook ((typescript-mode js2-mode web-mode) . lsp)
       :bind (:map lsp-mode-map
              ("TAB" . completion-at-point))
       :custom
       (lsp-headerline-breadcrumb-enable nil)
       (lsp-eldoc-enable-hover nil)
       (lsp-signature-auto-activate nil)
       (lsp-completion-enable t)
      )
   #+end_src

** lsp-python-ms
#+begin_src emacs-lisp
(use-package lsp-python-ms
  :ensure t
  :init (setq lsp-python-ms-auto-install-server t)
  :hook (python-mode . (lambda ()
                          (require 'lsp-python-ms)
                          (lsp))))  ; or lsp-deferred
#+end_src
** lsp-ui

   lsp-ui is a set of UI enhancements built on top of lsp-mode which make Emacs feel even more like an IDE. Check out the screenshots on the lsp-ui homepage (linked at the beginning of this paragraph) to see examples of what it can do.
   #+begin_src emacs-lisp
     (use-package lsp-ui
       :ensure t
       :hook (lsp-mode . lsp-ui-mode)
       :config
       (setq lsp-ui-sideline-enable t)
       (setq lsp-ui-sideline-show-hover nil)
       (setq lsp-ui-doc-position 'bottom)
       (lsp-ui-doc-show))
   #+end_src
** pyvenv
  #+begin_src emacs-lisp
    (use-package pyvenv
      :ensure t
      :defer t
      :diminish t
      :config
      (setq pyvenv-mode-line-indicator '(pyvenv-virtual-env-name ("[venv:" pyvenv-virtual-env-name "] ")))
	(pyvenv-mode t))

  #+end_src
** pyright
  #+begin_src emacs-lisp
(use-package lsp-jedi
  :after lsp-mode
  :ensure t)

  #+end_src
** flycheck
  #+begin_src emacs-lisp
    (use-package flycheck
      :init
      (global-flycheck-mode))
  #+end_src

* Enable EXWM
Only if we set the special flag file "enable_exwm"

#+begin_src emacs-lisp
(if (file-exists-p "~/emacs-conf/enable-exwm")
  (load (expand-file-name "~/emacs-conf/exwm_init.el"))
  (progn
    (print "No EXWM config in this system")
    (global-set-key (kbd "M-<up>") 'windmove-up)
    (global-set-key (kbd "M-<down>") 'windmove-down)
    (global-set-key (kbd "M-<left>") 'windmove-left)
    (global-set-key (kbd "M-<right>") 'windmove-right)))
#+end_src
